ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';  // Mendapatkan kata kunci pencarian dari form
        $model = new ArtikelModel();

        // Menambahkan pagination dan pencarian
        $data = [
            'title'   => $title,
            'q'       => $q,  // Menyimpan nilai pencarian
            'artikel' => $model->like('judul', $q)->paginate(10),  // Membatasi 10 artikel per halaman dan memfilter berdasarkan 'judul'